Repository: t-mansoberano/ContextWeaver
Catalog: Resources/ReportStrings.*.resx
Languages: es

# AnalysisOf
source: This file is a merged representation of the codebase for '{0}', combined into a single document by ContextWeaver.
es: Este archivo es una representación consolidada del código fuente de '{0}', fusionado en un único documento por ContextWeaver.

source: File Summary
es: Resumen del Archivo

source: Purpose
es: Propósito

# PurposeDescription
source: This file contains a packed representation of the repository's contents. It is designed to be easily consumable by AI systems for analysis, code review, or other automated processes.
es: Este archivo contiene una representación empaquetada de los contenidos del repositorio. Está diseñado para ser fácilmente consumible por sistemas de IA para análisis, revisión de código u otros procesos automatizados.

source: File Format
es: Formato del Archivo

# FileFormatDescription
source: The content is organized as follows: 1. This summary section 2. A "Hotspots" section identifying key files by metrics 3. An "Instability Analysis" section providing architectural insights 4. A directory structure tree with clickable links to each file 5. Multiple file entries, each consisting of: a. A header with the file path (## File: path/to/file) b. The "Repo Map" summary (public API and imports) c. The full contents of the file in a code block
es: El contenido se organiza de la siguiente manera: 1. Esta sección de resumen 2. Una sección de "Hotspots" que identifica archivos clave por métricas 3. Una sección de "Análisis de Inestabilidad" que proporciona información arquitectónica 4. Un árbol de la estructura de directorios con enlaces clicables a cada archivo 5. Múltiples entradas de archivo, cada una de las cuales consta de: a. Un encabezado con la ruta del archivo (## Archivo: ruta/al/archivo) b. El resumen del "Repo Map" (API pública e importaciones) c. El contenido completo del archivo en un bloque de código

source: Usage Guidelines
es: Pautas de Uso

# UsageGuidelinesDescription
source: - This file should be treated as read-only. Any changes should be made to the original repository files, not this packed version. - When processing this file, use the file path to distinguish between different files in the repository. - Be aware that this file may contain sensitive information. Handle it with the same level of security as you would the original repository.
es: - Este archivo debe ser tratado como de solo lectura. Cualquier cambio debe realizarse en los archivos originales del repositorio, no en esta versión empaquetada. - Al procesar este archivo, use la ruta del archivo para distinguir entre los diferentes archivos del repositorio. - Tenga en cuenta que este archivo puede contener información sensible. Manéjelo con el mismo nivel de seguridad que manejaría el repositorio original.

source: Notes
es: Notas

# NotesDescription
source: - Some files may have been excluded based on ContextWeaver's configuration in `.contextweaver.json` or the default `appsettings.json`. - Binary files are not included in this packed representation. - Files are sorted alphabetically by their full path for consistent ordering.
es: - Algunos archivos pueden haber sido excluidos según la configuración de ContextWeaver en `.contextweaver.json` o el `appsettings.json` por defecto. - Los archivos binarios no se incluyen en esta representación empaquetada. - Los archivos se ordenan alfabéticamente por su ruta completa para una ordenación consistente.

# HotspotsAnalysisTitle
source: 🔥 Hotspots Analysis
es: 🔥 Análisis de Hotspots

# HotspotsTop5ByImports
source: Top 5 Files by Number of Imports
es: 5 Principales Archivos por Número de Importaciones

# HotspotsTop5ByLOC
source: Top 5 Files by Lines of Code (LOC)
es: 5 Principales Archivos por Líneas de Código (LOC)

# InstabilityAnalysisTitle
source: 📊 Instability Analysis
es: 📊 Análisis de Inestabilidad

# InstabilityIntro
source: This section estimates the Instability (I) metric for each top-level module (folder/project) based on its dependencies (imports).
es: Esta sección estima la métrica de Inestabilidad (I) para cada módulo de nivel superior (carpeta/proyecto) basándose en sus dependencias (importaciones).

# InstabilityCe
source: - `Ce` (Efferent): How many other modules this module uses (points outwards).
es: - `Ce` (Eferente): Cuántos otros módulos usa este módulo (apunta hacia afuera).

# InstabilityCa
source: - `Ca` (Afferent): How many other modules depend on this module (point inwards).
es: - `Ca` (Aferente): Cuántos otros módulos dependen de este módulo (apunta hacia adentro).

# InstabilityModuleOverview
source: Module Instability Overview:
es: Resumen de Inestabilidad del Módulo:

# InstabilityInterpretationGuide
source: Interpretation Guide:
es: Guía de Interpretación:

# InstabilityGuideStable
source: - `I ≈ 0`: Very stable (many depend on it; depends little on others). Often core contracts/interfaces.
es: - `I ≈ 0`: Muy estable (muchos dependen de él; depende poco de otros). A menudo son contratos/interfaces principales.

# InstabilityGuideUnstable
source: - `I ≈ 1`: Very unstable (depends on many; few or none depend on it). Often concrete implementations like UI/adapters.
es: - `I ≈ 1`: Muy inestable (depende de muchos; pocos o ninguno dependen de él). A menudo son implementaciones concretas como UI/adaptadores.

# InstabilityGuideIntermediate
source: - `I ≈ 0.5`: Intermediate stability.
es: - `I ≈ 0.5`: Estabilidad intermedia.

# InstabilityGuideIdeal
source: Ideally, stable modules should be abstract, and unstable modules concrete. Avoid highly abstract, unstable modules, or highly concrete, stable modules.
es: Idealmente, los módulos estables deben ser abstractos y los inestables concretos. Evite módulos abstractos muy inestables o módulos concretos muy estables.

# InstabilityDescStable
source: Very Stable / Core
es: Muy Estable / Core

# InstabilityDescUnstable
source: Very Unstable / Concrete
es: Muy Inestable / Concreto

# InstabilityDescIntermediate
source: Intermediate Stability
es: Estabilidad Intermedia

source: Directory Structure
es: Estructura de Directorios

source: Files
es: Archivos

# FileHeader
source: File: {0}
es: Archivo: {0}

# RepoMapTitle
source: Repo Map: Public API Signatures and Imports Extraction
es: Mapa del Repositorio: Extracción de Firmas Públicas e Imports

source: Public API:
es: API Pública:

source: Metrics
es: Métricas

# LinesOfCode
source: Lines of Code (LOC):
es: Líneas de Código (LOC):

source: Source Code
es: Código Fuente

# InstabilityTableHeader
source: | Module | Ca (Efferent) | Ce (Afferent) | Instability (I) | Description |
es: | Módulo | Ca (Eferente) | Ce (Aferente) | Inestabilidad (I) | Descripción |
